In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('PastHires.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Years Experience    13 non-null     int64
 1   Employed?           13 non-null     object
 2   Previous employers  13 non-null     int64
 3   Level of Education  13 non-null     object
 4   Top-tier school     13 non-null     object
 5   Interned            13 non-null     object
 6   Hired               13 non-null     object
dtypes: int64(2), object(5)
memory usage: 856.0+ bytes

## staj yapmismi, calisiyormu

In [7]:
df.replace({'Y':1, 'N':0, 'BS':1, 'MS':2, 'PhD':3}, inplace=True)
df

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,1,4,1,0,0,1
1,0,0,0,1,1,1,1
2,7,0,6,1,0,0,0
3,2,1,1,2,1,0,1
4,20,0,2,3,1,0,0
5,0,0,0,3,1,1,1
6,5,1,2,2,0,1,1
7,3,0,1,1,0,1,1
8,15,1,5,1,0,0,1
9,0,0,0,1,0,0,0
10,1,0,1,3,1,0,0
11,4,1,1,1,0,1,1
12,0,0,0,3,1,0,1

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Years Experience    13 non-null     int64
 1   Employed?           13 non-null     int64
 2   Previous employers  13 non-null     int64
 3   Level of Education  13 non-null     int64
 4   Top-tier school     13 non-null     int64
 5   Interned            13 non-null     int64
 6   Hired               13 non-null     int64
dtypes: int64(7)
memory usage: 856.0 bytes

In [9]:
df.corr()

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
Years Experience,1.000000,0.265195,0.644131,-0.035951,-0.200427,-0.356917,-0.201773
Employed?,0.265195,1.000000,0.340709,-0.327815,-0.414758,0.025000,0.527046
Previous employers,0.644131,0.340709,1.000000,-0.389535,-0.529534,-0.397494,-0.166268
Level of Education,-0.035951,-0.327815,-0.389535,1.000000,0.759797,-0.150249,-0.172774
Top-tier school,-0.200427,-0.414758,-0.529534,0.759797,1.000000,-0.097590,-0.051434
Interned,-0.356917,0.025000,-0.397494,-0.150249,-0.097590,1.000000,0.527046
Hired,-0.201773,0.527046,-0.166268,-0.172774,-0.051434,0.527046,1.000000

In [10]:
abs(df.corr()['Hired']).sort_values(ascending=False)

Hired                 1.000000
Employed?             0.527046
Interned              0.527046
Years Experience      0.201773
Level of Education    0.172774
Previous employers    0.166268
Top-tier school       0.051434
Name: Hired, dtype: float64

In [12]:
df[df['Employed?']==1] #Employed sutununun 1 lerini getir

,Years Experience,Employed?,Previous employers,Level of Education,Top-tier school,Interned,Hired
0,10,1,4,1,0,0,1
3,2,1,1,2,1,0,1
6,5,1,2,2,0,1,1
8,15,1,5,1,0,0,1
11,4,1,1,1,0,1,1

In [13]:
y = df.Hired

In [14]:
x = df.drop('Hired', axis=1)

In [15]:
x.columns

Index(['Years Experience', 'Employed?', 'Previous employers',
       'Level of Education', 'Top-tier school', 'Interned'],
      dtype='object')

In [16]:
features = list(df.columns[:6])
features

['Years Experience',
 'Employed?',
 'Previous employers',
 'Level of Education',
 'Top-tier school',
 'Interned']

In [17]:
x = df[features]

In [18]:
from sklearn.tree import DecisionTreeClassifier

In [19]:
clf = DecisionTreeClassifier()

In [20]:
clf = clf.fit(x, y)

In [21]:
clf.predict([[10, 1, 4, 3, 1, 0]])

C:\Users\nepes\miniconda3\envs\yapay-zeka\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [23]:
clf.predict([[0, 0, 0, 1, 0, 1]])

C:\Users\nepes\miniconda3\envs\yapay-zeka\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [24]:
clf.predict([[5, 0, 0, 0, 0, 1]])

C:\Users\nepes\miniconda3\envs\yapay-zeka\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)